Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/blood_and_organ_donation/hepatitis_c_and_health_amendment_act_cards.html.txt.tmx
Source language: en
Languages: ga

source: Hepatitis C and the Health Amendment Act Card
ga: Heipitíteas C agus an Cárta faoin Acht Sláinte (Leasú)

source: There are special arrangements within the health services for people who have contracted Hepatitis C directly or indirectly through the administration within the State of Human Immunoglobulin-Anti-D or another blood product or a blood transfusion
ga: Tá socruithe speisialta ann laistigh de na seirbhísí sláinte do dhaoine a rinne Heipitíteas C a tholgadh go díreach nó go hindíreach trí Ghlóbailin Imdhíonachta Daonna-Frith-D nó trí tháirge fola eile nó fuilaistriúchán a riaradh laistigh den Stát

source: These services are covered by the Health Amendment Act Card (HAA Card)
ga: Tá na seirbhísí seo cumhdaithe ag an gCárta faoin Acht Leasú Sláinte (Leasú) (Cárta ALS)

source: Hepatitis C Insurance Scheme
ga: Scéim árachais Heipitíteas C

source: The Hepatitis C insurance scheme enables those infected with Hepatitis C and/or HIV, through the administration within the State of contaminated blood or blood products, to take out life assurance, mortgage protection and travel insurance
ga: Cuireann an scéim árachais Heipitíteas C ar chumas iad siúd ar a bhfuil Heipitíteas C agus/nó VEID, trí fhuil nó táirgí fola éillithe a riaradh laistigh den Stát, chun árachas saoil, cosaint morgáiste agus árachas taistil a fháil

source: Under this scheme a person requiring insurance will pay the average basic premium which an uninfected person of the same age and gender would pay
ga: Faoin scéim seo, íocfaidh duine óna dteastaíonn árachas an mheánphréimh bhunúsach a d’íocfadh duine den aois agus den inscne céanna nach bhfuil an galar orthu

source: The insurance scheme pays the additional premiums levied or covers the additional risks that would otherwise prevent a policy being taken out
ga: Íocann an scéim árachais na préimheanna breise a ghearrtar nó cumhdaíonn sí na rioscaí breise a chuirfeadh cosc, murach sin, ar pholasaí a ghlacadh

source: The Hepatitis C Insurance Scheme is set up under the Hepatitis C Compensation Tribunal (Amendment) Act (No.22) of 2006 (pdf)
ga: Déanann an tAcht um Binse Cúitimh i ndáil le Heipitíteas C (Leasú), (Uimh. 22 de 2006) (pdf) cur i bhfeidhm agus oibriú na Scéime Árachais Heipitíteas C a rialú

source: If you have contracted Hepatitis C directly or indirectly through the administration within the State of Human Immunoglobulin-Anti-D or another blood product or a blood transfusion, you can apply for a Health Amendment Act (HAA) Card
ga: Má rinne tú Heipitíteas C a tholgadh go díreach nó go hindíreach trí Ghlóbailin Imdhíonachta Daonna-Frith-D nó trí tháirge fola eile nó fuilaistriúchán a riaradh laistigh den Stát, féadfaidh tú iarratas a dhéanamh ar Chárta faoin Acht Sláinte (Leasú) (ASL)

source: The HAA Card entitles you to the following services, free of charge
ga: Tugann an Cárta ASL an teidlíocht duit na seirbhísí a leanas a fháil saor in aisce

source: • Prescribed drugs and medicines and medical and surgical aids and appliances
ga: • Drugaí agus míochaine ar oideas agus trealamh cúnta agus fearas leighis agus máinliach

source: • Home nursing and home support services
ga: • Altranas baile agus seirbhísí tacaíochta baile

source: • Dental, ophthalmic and aural services and appliances
ga: • Fiaclóireacht, oftailmeach agus seirbhísí agus fearas cluasa

source: • Counselling services for both you and your family and
ga: • Seirbhísí comhairle duit féin agus do do theaglach agus

source: • Such other services as may be prescribed by the Minister for Health
ga: • Aon seirbhísí eile a thograíonn an tAire Sláinte a chur ar fáil

source: This is an individual entitlement for the person with Hepatitis C
ga: Is é/í an duine a bhfuil Heipitíteas C air/uirthi atá i dteideal na seirbhísí seo

source: However, dependants are entitled to a free counselling in respect of Hepatitis C
ga: Ach, tá seirbhísí comhairlithe ar fáil in aisce do chleithiúnaithe maidir le Heipitíteas C

source: These counselling services are provided by private practitioners, by arrangement between you and the Health Service Executive (HSE)
ga: Cuireann cleachtóirí príobháideacha na seirbhísí comhairlithe ar fáil ach socrú a dhéanamh idir thú féin agus Feidhmeannacht na Seirbhíse Sláinte

source: You are entitled to these services free of charge even if you require them for non-Hepatitis C-related illnesses
ga: Tá tú i dteideal na seirbhísí seo saor in aisce fiú má theastaíonn siad uait do thinnis nach mbaineann le Heipitíteas C

source: All GPs are eligible to provide services. You do not have to choose a GP who is part of the Primary Care Re-imbursement Service
ga: Is féidir le gach LG na seirbhísí seo a chur ar fáil, ní gá duit LG atá páirteach sa scéim Sheirbhísí Ginearálta Leighis a roghnú

source: Home support services can be provided by the home help service in the HSE
ga: Féadfaidh an tseirbhís chúntóirí sa bhaile in FSS seirbhísí tacaíochta baile a sholáthar

source: If you are considered to be in need of home help services, the HSE Area may provide the service directly or you may make your own arrangements
ga: Má cheaptar go bhfuil seirbhísí cúnaimh bhaile ag teastáil uait d'fhéadfadh sé go gcuirfeadh an Limistéar FSS an tseirbhís sin ar fáil go díreach nó d'fhéadfadh tú na socruithe a dhéanamh tú féin

source: If you make your own arrangements, you are the employer of the home help and you are responsible for your employee's PRSI and Tax
ga: Má dhéanann tú na socruithe tú féin, is tusa fostóir an té atá i mbun an chúnaimh agus tá tú freagrach as ÁSPC an fhostaí, cáin & rl

source: The HSE pays a contribution to the costs involved
ga: Íocann an FSS cuid den chostas atá i gceist

source: Dental, ophthalmic and aural services are provided on broadly the same basis for medical card holders
ga: Cuirtear seirbhísí fiaclóireachta, oftailmeacha agus cluasa ar fáil ar an mbonn céanna mórán agus atá siad curtha ar fáil do shealbhóirí cártaí leighis

source: However, there are more favourable arrangements for HAA Card holders
ga: Tá socruithe níos fabhraí ann do shealbhóirí an Chárta ASL, áfach

source: You can get hearing aids and aural services by arrangement with the HSE
ga: Is féidir leat cluaisíní cúnta a fháil agus seirbhísí cluasa ach socrú a dhéanamh leis an FSS

source: The HSE arranges for the supply of medical and surgical appliances that are not available from a pharmacist
ga: Déanann an FSS socrú go mbeadh fearas leighis agus máinliach nach féidir teacht air sa chógaslann curtha ar fáil

source: To apply for a HAA Card contact your Hepatitis C Liaison Officer in your Local Health Office or the National Hepatitis C Office
ga: Chun iarratas a dhéanamh ar Chárta ASL, déan teagmháil le d’Oifigeach Idirchaidrimh Heipitíteas C nó leis an Oifig Náisiúnta Heipitíteas C – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: Your entitlement to these services lasts for life
ga: Eisítear Cárta faoin Acht um Leasú Sláinte duit

source: Further details on entitlements and how to access them will be provided by the Hepatitis C Liaison Officer in your Local Health Office
ga: Tá tuilleadh eolais ar theidlíochtaí agus cén chaoi le theacht orthu ar fáil ó Oifigeach Teagmhála Heipitíteas C ag an oifig sláinte áitiúil

source: Entitlements are also set out in the Information Guide to Primary Care and Hospital Services (pdf)
ga: Tá teidlíochtaí leagtha síos sa Treoir Fhaisnéise maidir le Seirbhísí Cúraim Phríomhúil agus Ospidéil (pdf) freisin

source: Further details on entitlements and how to access them and a leaflet on living with Hepatitis C (pdf) can from be found on the website of the Consultative Council on Hepatitis C
ga: Is féidir breis sonraí ar theidlíochtaí agus ar conas iad a rochtain agus bileog ar mhaireachtáil le Heipitíteas C (pdf) a fháil ar láithreán gréasáin na Comhairle Comhairlí ar Heipitíteas C

source: Further information on Hepatitis C and Health Amendment Act Cards is available from:
ga: Tá tuilleadh eolais faoi Heipitíteas C agus Cártaí faoin Acht um Leasú Sláinte ar fáil ó:

source: National Hepatitis C Office
ga: Cumann Haemaifilia na hÉireann

source: New Street Dublin 8
ga: Baile Átha Cliath 8

source: Opening Hours:Monday to Friday 10am to 2pm
ga: Uaireanta Oscailte:Monday to Friday 10am to 2pm
